Repository: eugeneai/RSPO-CSharp
Catalog: doc/omegat/omegat-level2.tmx
Source language: en_us
Languages: ru_ru

source: ../_images/Architecture.png Data Model
ru_ru: Модель данных

source: A Semantic Data Model
ru_ru: Модель данных со схемой

source: An Associative Model
ru_ru: Ассоциативная модель

source: Automatic Data caching
ru_ru: Автоматическое кэширование данных

source: BrightstarDB has adopted a very flexible, associative data model based on the W3C RDF data model.
ru_ru: BrightstarDB построен на очень гибкой модели ассоциативных данных RDF.

source: BrightstarDB is a native .NET NoSQL semantic web database.
ru_ru: BrightstarDB реализован в среде .NRT и является nosql-база данных, поддерживающая Семантический веб.

source: BrightstarDB is a unique and powerful data storage technology for the .NET platform.
ru_ru: BrightstarDB является уникальной и мощной технологией хранения данных для .Net платформы.

source: BrightstarDB is a write once, read many store (WORM).
ru_ru: BrightstarDB является СУБД с однократной записью, многократным чтением (WORM).

source: BrightstarDB is unique in allowing application developers to map multiple .NET typed domain models over any BrightstarDB data store.
ru_ru: BrightstarDB является уникальным решением, позволяющем разработчикам приложений отображать несколько моделей в .NET в нескольких базах данных BrightstarDB.

source: BrightstarDB provides a complete typed domain model interface to work with the data in the store.
ru_ru: BrightstarDB предоставляет интерфейсы для обеспечения функционирования типизированной модели данных в хранилище.

source: BrightstarDB uses a form of data storage that preserves full historical data at every transaction point.
ru_ru: BrightstarDB использует форматы хранения данных, которые сохраняют полную информацию об истории на каждом этапе транзакции.

source: BrightstarDB uses the powerful and simple RDF graph data model to represent all the different kinds of models that are to be stored.
ru_ru: Граф RDF позволяет представлять все существующие, имеющие практический смысл, виды моделей данных.

source: Changes to either the object model or the relational schema often require a reciprocal change.
ru_ru: Изменения в объектной моделью и реляционной схемы требуют взаимного изменения.

source: Concepts Architecture
ru_ru: Архитектура Brightstar DB

source: Developer Friendly Toolset
ru_ru: Инструментарий, дружелюбный к разработчику

source: Each triple is the assignment of a property to an identified resource.
ru_ru: Каждая тройка -- это ассоциация свойства с определенным ресурсом или значением.

source: Few existing NoSQL databases offer a data model that understands, and automatically manages relationships between data entities.
ru_ru: Не много существует NoSQL\;--\;баз данных предлагают механизмы, которые <<понимают>> структуры данных и автоматически управляют отношениями между сущностями.

source: Full Historical Capabilities
ru_ru: Поддержание истории изменений

source: It can be used as an embedded database or run as a service.
ru_ru: Она используется в качестве встроенной базы данных или в качестве службы.

source: It combines flexibility, scalability and performance while allowing applications to be created using tools developers are familiar with.
ru_ru: Она сочетает в себе гибкость, масштабируемость и производительность. Технология позволяет создавать приложения, используя знакомые инструменты разработчиков.

source: Modifications to data are appended to the end of the storage file, no data is ever overwritten.
ru_ru: Изменения в данные добавляются в конец файла хранилища, данные никогда не перезаписываются.

source: Most NoSQL databases require the application developer to take care of updating ‘join’ documents, or adding redundant data into ‘document’ representations, or storing extra data in a key value store.
ru_ru: Большинство NoSQL\;--\;баз данных требуют от разработчика, чтобы он сам заботился об обновлении связей между документами и хранении дополнительных данных в дополнительном хранилище ключей--значение.

source: Most developers on .NET are accustomed to using objects and LINQ for building their applications.
ru_ru: Большинство разработчиков на .NET привыкли использовать объекты и linq для построения своих приложений.

source: Native .NET Semantic Web Database
ru_ru: Обеспечение средств Семантического веба при помощи технологий .NET

source: Normally, data caching is done by applications but BrightstarDB provides this feature as a core capability.
ru_ru: Как правило, кэширование данных производится самими приложениями, но BrightstarDB обеспечивает эту функцию как ключевую возможность.

source: Query results, and entity representations are cached to further improve performance for query intensive applications.
ru_ru: Результаты запроса и представления кэшируется для повышения производительности приложений с интенсивным использованием запросов к БД.

source: RDF on the other hand can ideally be used to store both literal properties and object relationships and if the object model needs to change then new property value can be added as there is no fixed schema.
ru_ru: RDF, в идеале, может быть использован для хранения и свойств-значений и отношений между объектами. Если объектная модель изменяется, то новое значение свойства может быть просто добавлено, так как нет фиксированной схемы.

source: Reads are not blocked while writes occur.
ru_ru: Так как запись производится только одним клиентом, и данные не перезаписываются, то нет и необходимости в реализации блокировок.

source: Schema-less Data Store
ru_ru: Хранение данных без хранения схемы данных

source: Similarly, if additional RDF data is added to the store the object model can either ignore or make use of this data.
ru_ru: Аналогичным образом, если дополнительные данные добавляется в хранилище в виде RDF, то в объектная модель может либо игнорировать, либо использовать эти данные.

source: Storage Features
ru_ru: Особенности хранения данных

source: The Entity Framework tools take .NET interfaces and generate concrete classes that persist their data in BrightstarDB.
ru_ru: Инструментарий, совместимый с Entity Framework, также порождает объектный контекст при помощи задаваемых разработчиком .NET-приложений интерфейсов хранимых объектов в BrightstarDB.

source: The WORM store approach supports rollback or querying of the complete database at any transaction point.
ru_ru: WORM-подход поддерживает откат и запросы по всей истории состояний базы данных на любом этапе транзакции.

source: The associative model used in BrightstarDB means data can be inserted into a BrightstarDB database without the need to define a traditional database schema.
ru_ru: Используемая ассоциативная модель позволяет добавлять новые данные в базу данных BrightstarDB без традиционной необходимости определения схемы данных.

source: The model is based on a concept of a triple.
ru_ru: Модель основана на концепции троек.

source: The store can be periodically coalesced to manage file size growth at the expense of removing previous transaction points.
ru_ru: База данных может периодически консолидироваться, при этом происходит удаление ненужной истории, и это позволяет управлять ростом размера файла хранилища.

source: This allows applications to perform queries at any previous point in time, it ensures fully audit-able data and allows data stores to be returned to any previous state or snapshots taken at any point in time.
ru_ru: Это позволяет приложениям выполнять запросы в любой момент времени, она обеспечивает полную проверку состояния данных и хранилище данных, а также возврат в предыдущее состояние или снимок, которые, в свою очередь, могут делаться в любой момент времени.

source: This approach does increase the amount of disk space used, but BrightstarDB provides a feature to consolidate down to just the currently required data.
ru_ru: Такой подход увеличивает объем используемого дискового пространства, но BrightstarDB предоставляет возможность консолидировать данные, относящиеся только к текущему моменту времени.

source: This flexibility means that evolving systems, or creating systems that merge data together is very simple.
ru_ru: Эта гибкость означает, что разработка эволюционирующих систем, или создание систем, которые объединяются вместе становиться очень простым процессом.

source: This further enhances flexibility and supports solution evolution which is a critical feature of modern software solutions.
ru_ru: Это еще больше повышает гибкость и поддерживает эволюцию разработки, которая является важнейшей особенностью именно современных программных решений.

source: This makes many NoSQL databases not particularly good at dealing with many real word data models, such as social networks, or any graph like data structure.
ru_ru: Поэтому некоторые NoSQL--БД не особо хорошо справляются со многими моделями реальных данных, таких как социальные сети или структуры данных на графах.

source: This means that many different object models can overlay the same semantic data model.
ru_ru: Причем, множество различных объектных моделей могут налагаться друг на друга в общей семантической модели данных.

source: This simple structure can be used to describe and represent data of any shape.
ru_ru: Эта простая структура может быть использована для описания и представления данных <<любой формы>>.

source: When run as a service clients can connect using HTTP, TCP/IP or Named Pipes.
ru_ru: К серверу можно подключаться по протоколам HTTP, TCP/IP и по поименованным каналам.

source: While the core data model is RDF triples and the query language SPARQL BrightstarDB provides a code-first Entity Framework.
ru_ru: BrightstarDB обеспечивает поддержук Entity Framework в режиме Code First.

source: While the schema-less data store enables data of any shape to be imported and linked together, application developers often need to work with a specific shape of data.
ru_ru: Хранилища без схемы данных позволяют данным любой формы быть импортированными и связанными друг с другом, но разработчикам приложений часто необходимо работать с данными определенной формы.

source: Why BrightstarDB?
ru_ru: Почему BrightstarDB?

source: With support for the SPARQL query language and also the NTriples data format building semantic web based applications is simple and fun with BrightstarDB.
ru_ru: В BrightstarDB существует поддержка языка запросов sparql, а также экспорт/импорт данных в формате NTriples, используемые при построении семантических веб-приложений.
